export default {
  buysuc: "购买成功",
  kjzsy: "矿晶总收益",
  bzkjsy: "本周矿晶累积收益",
  gmkj: "购买矿机，产量",
  yqhy: "邀请好友获取算力",
  checkrecord: "查看记录",
  kj: "矿机",
  tkj:'目标矿机',
  kjtype:'类型',
  mrsl: "默认算力",
  mbkjsy: "目标矿晶收益",
  dqkjsy: "当前矿晶收益",
  wksysj: "挖矿剩余时间",
  ljjs: "累计减少：",
  jstimes: "加速次数",
  slmj: "算力秘籍",
  cksq: "查看矿工",
  kcjl: "矿池记录",
  ksdh: "快速兑换",
  dh: "兑换",
  xxjlck: "详细记录至兑换中心查看",
  dhzx: "兑换中心",
  dhjl: "兑换记录",
  dhtime: "时间",
  dhdui: "兑换对",
  dhsl: "兑换数量",
  mypool: "运行矿机",
  mypoolrecord:'矿工记录',
  kg: "矿工",
  kjzj: "矿机总价",
  jszl: "加速总量",
  gmsj: "购买时间",
  kjsc: "矿机商城",
  wksc: "挖矿时长",
  mbkj: "目标矿晶",
  yjkjsy: "预计矿晶收益",
  day: "天",
  tai: "台",
  gm: "购买",
  sysl: "剩余数量",
  slmjrh: "算力秘籍，如何玩转超级算力",
  cjsl: "超级算力",
  step1: ` 将CJT兑换成SUC积分，开启矿机购买模式。
                    <br> 
                     点击右上角的“兑换中心”，即可快速进行积分兑换，CJT与SUC可以进行互兑。`,
  step2: `选择合适的矿机，进行购买，每个矿机的矿晶将在购买后的预计时间全部产出完毕。
                    <br>  算力：算力越高的矿机，挖矿的时间将大幅度缩短。 
                    <br> 产量：矿机产出的矿晶（即SUC，可兑换成CJT）。`,
  step3: ` 邀请好友，组建社区，协作解锁模式开始，每成功邀请一位好友注册平台并购买矿机，将为自己的矿机解锁好友购买矿机金额的8%作为奖励。
                    <br> 节点社区的奖励也将按照对应社区的奖励制度进行发放，具体发放以具体奖励政策
                    为准。
                    <br> 平台将在矿机购买后的每7个自然日结算并划转一次奖励（SUC）至游戏账户内，
                    <br> 用户可根据需求兑换撑CJT。
                    <br> 奖励的解锁额度将按照矿机购买的时间由旧至新的时间排序进行顺序解锁，若某一
                    <br> 矿机产出完毕后还剩余解锁额度，将顺延至下一台矿机进行继续解锁。    `,
  step4: `可以购买多台矿机，组成庞大的矿池，产量UP！矿机数量有限，可以按照需要进
                    行购买。`,
  norecord:'暂时没有记录',
  kjtosee:'敬请期待',
  nostocks:'库存不足',
  cancel:'取消',
  confirm:'确认',
  surebuy:'确定要购买{kj}吗？',
  nodata:'暂时没有记录'
};
