
const src = require('../assets/images/tttt.png');
export default [
    {
        belong: '平台介绍',
        question: [
            {
                title:`什么是Crypto Joy?`,
                content: `
                Crypto Joy（以下简称CJ）是全球首个建于以太坊上基于游戏工作量证明的去中心化游戏平台，CJ平台中建立了“无边积分、永恒记录、真实道具、行为价值”四大核心生态，通过游戏联盟社区自治的方式共建、共享、共赢整个CJ生态网络。CJ平台基于“游戏即挖矿”的社区共识，通过四大核心生态重构游戏机构与游戏玩家之间的互动模式，并建立CJ游戏服务中心的DApp，为整个生态去中心化运转提供支持和协助。
                <br>CJ(Crypto Joy) 认为游戏行为本身具有极大的商业价值，所有游 戏参与者的游戏行为本身就是一种“游戏参与即挖矿”，这其中包含数据 存储 、传播、参与、交易等行为，CJ 将通过相应工作量来发放等值 CJT (CJ 代币)，通过 CJT 的发放、确权、价值认定来激励整个游戏生态中 的数据积累和流转，推动游戏玩家的参与热情和游戏本身的价值增值。`
            },
            {
                title: `为什么做Crypto Joy这个平台？`,
                content: `游戏是一种能够模糊现实与虚拟、能够让玩家直接获得快感的艺术，游戏同时也是一个古典的经济系统，玩家通过在游戏中所付出的劳动和时间来获得游戏经济系统中的财富。但是传统游戏中又存在着一个最大的问题，每一个游戏都是独立封闭的中心化经济系统，可以被人为改动的，这样一来一个游戏中的劳动收入无法转入和连接到另一游戏经济系统。但是在区块链产生后，Crypto Joy团队在其中受到了启发，认为区块链安全可信、分布式记账、不可篡改的特性恰好可以实现古典游戏中的不足，从而使得玩家和开发者的利益能够实现一致。`
            },
            {
                title: `Crypto Joy的团队？`,
                content: `Crypto Joy团队是由一群以太坊社区的爱好者共同开发完成，他们中有区块链的资深工程师，有游戏公司的开发者，有精通金融市场的华尔街交易员和金融学家，还有西洋棋高手少年。他们在以太坊社区中相识，分布式办公，没有办公室，没有公司主体，没有机构入驻，游戏平台完全由代码控制，平台历时半年开发测试，游戏简单易学，又充满刺激，游戏过程完全透明。所有游戏资产也完全上链，游戏历史记录全部可以查询。`
            }
        ]
    },
    {
        belong: '平台经济模型介绍',
        question: [
            {
                title: `什么是 CJS, CJT?`,
                content: `CJ平台玩家拥有流通通证CJT（Crypto Joy Token）和股权通证CJS(Crypto Joy Stake) Crypto Joy token，简称 CJT，CJT 是基于 CJ 平台的唯一流通通证，承担整个 CJ 平台的数字资产 流通枢纽重任，玩家通过平台规定法定数字货币兑换获得 CJT， 在进入不同游戏之后再将 CJT 兑换成该游戏虚拟代币 GT。CJT 通用积分作为 CJ 游戏服务生态圈的底层通证，服务于 CJ 游戏服务平台上所有的生态角色，通过“游戏参与即挖矿” 机制建立游戏数据服务共识机制，打破游戏价值孤岛效应，循环服务游 戏玩家。 
                <br>Crypto Joy Stake，简称CJS，CJS 作为玩家在CJ平台的股权通证，代表者整个 CJ 平台所能产生的价值收益，CJS 被定义成 1:1 锚定 CJT，玩家可以通过 CJT 兑换获得 CJS， 同时平台会定期将部分平台收益按照 CJS 总量进行等比派送，让所有 CJS 持有者能获得平台收益。 <p class="center" ><img style="max-width: 100%" src="${src}"></p>`
            },
            {
                title: `每款游戏都有不同的积分，是否都与CJT有等同的价值呢？是否可以直接使用CJT进行通用的游戏结算？
                `,
                content: `玩家在进行游戏时，首先需要确保账户内有充足的CJT，其次是需要根据每款游戏的规则进行适当的游戏积分通兑，最后才能进行游戏。游戏积分代表某款游戏内的工作量证明，只在对应游戏中有流通价值，但游戏是相对独立的，每种游戏的积分都代表其游戏的不同权益，是无法进行游戏积分间相互的兑换，但是游戏中产生的收益都可以根据平台公布的互兑比例快捷的兑换成CJT，兑换的CJT可在平台钱包中查看。`
            },
        ]
    },
    {
        belong: 'Funny up',
        question: [
            {
                title: `什么是Funny up？`,
                content: `Funny up是一款可多人同时在线的区块链博弈游戏，它由一个随时可能崩溃的渐增曲线组成，每一轮游戏的曲线崩溃值由特殊算法所产生的随机数决定，算法及每轮崩溃值也都将被记录在区块链上进行全网公示来保证游戏的安全与透明性。`
            },
            {
                title: `怎么玩？`,
                content: `游戏根据下注金额分为三个等级的房间，玩家可根据自己的游戏下注金额来决定进入哪一层房间。选定房间 后，点击进入游戏。游戏开始前，您有6秒的时间下注，游戏开始后，倍数从1X开始逐渐升高。
                <br>您可以在任何时候点击“Cash out”来锁定当前倍数，您的收益就是您下的赌注金额乘以当前倍数。
                在游戏中逃跑得越晚，您获得的收益就会越高。但请注意，曲线随时会崩溃，如果在崩溃前您没逃跑，您会失去您的赌注。
                <br>是在1.10倍就跑，还是100倍逃跑？全在您弹指之间！(玩的不仅是心跳，更是心态)
                `
            },
            {
                title: `什么是奖池？
                `,
                content: `奖池是平台用来支付给游戏获胜玩家的资金池
                <br>玩家可以从一轮游戏中获得的最大利润取决于奖池的大小。奖池越多，玩家获得越多
                `
            },
            {
                title: `奖池的资金如何运作？
                `,
                content: `平台会在游戏原始期充入不同金额的奖金到三个房间的奖池中（如果奖池被玩家赢取过多，平台会再次充入一定的金额来保证游戏玩家的收益）
                <br>每轮游戏开始后，平台会抽取2%的投注额作为平台和投注者的收益，98%将充入到奖池里面（不影响玩家的收益结算）
                <br>胜利玩家的收益将从奖池里面扣除。`
            },
            {
                title: `自动逃跑有什么用？
                `,
                content: `防止网络延迟的最佳工具是使用自动逃跑功能。由于您的自动逃跑在下注时会发送到服务器，因此服务器可以为您准确逃跑，无论延迟如何。
                <br>例如：如果您的连接不好，而您想2倍逃跑，那么我们建议您在游戏下注时将自动逃跑设置为2倍，而不是依靠手动逃跑来达到2倍。因为在您点击逃跑之后，在您的信息到达服务器之前，曲线可能会崩溃。
                `
            },
            {
                title: `游戏公平吗？
                `,
                content: `Crypto Joy是一个公平、透明的区块链游戏平台，所有游戏算法及游戏记录都将保存在区块链上，我们的目标就是消除一切不公平因素，让玩家玩得放心、玩得开心。
                <br>Funny up中递增曲线的崩溃值由记录上区块链上的特定算法所产生的随机数产生，该算法为无法破解，因此保证了每一轮游戏的公平性与安全性。
                <br>换句话说，游戏每一期的崩溃数字是由加密算`
            },
        ]
    },
    {
        belong: '超级算力',
        question: [
            {
                title: `什么是超级算力？`,
                content: `超级算力是基于区块链技术打造的算力整合型矿工游戏，每一个玩家就是一个节点，完美的将算力节点众筹/算力转化/算力分配/算力收益分配与区块链相结合，创新性的建立了“闲置算力服务来挖矿”的全新模式。
                <br>超级算力建立“Proof of Calculating service”（算力服务工作量证明）的共识机制，通过构建玩家电脑闲置服务器算力+智能矿机动态分配挖矿的处理模式，有效利用玩家电子设备的闲置算力，通过平台矿机的智能收集及分配，将其转化为可享收益的社区共享算力，由所购矿机进行合理统一分配，产生算力服务收益。`
            },
            {
                title: `怎么玩？`,
                content: `超级算力平台中玩家的算力共享收益由静态收益（闲置算力投资挖矿收益）+动态收益（共享算力邀约证明）叠加而成。静态收益部分由玩家购买矿机，进行算力挖矿，享受矿晶出矿收益；动态收益部分由玩家邀请好友加入挖矿，进行算力支持，增加矿机算力深度，缩短挖矿周期，提前获得总体矿晶收益。动态收益将每天进行统计，每周进行发放，助力玩家提前接触矿底收获矿晶。`
            },
            {
                title: `公平性验证？`,
                content: `玩家的所有购买记录以及算力邀约记录都将被完整的记录于个人账户内，收益也将于每个自然日自动刷新，算力的加速值完全可以清晰的定位至团队个人包括购买的矿机。这完整的逻辑以数据的可追溯性、游戏过程的公开性、游戏积分的可兑换性为基础，为玩家增添强有力的保障。`
            },
            {
                title: `矿机如何购买？`,
                content: `可在CJ平台将CJT兑换为矿晶积分SUC，每一类型矿机都可使用SUC 进行购买。`
            },
        ]
    }
]


