export default {
  buysuc: "购买成功",
  kjzsy: "矿晶总收益",
  bzkjsy: "本周矿晶累积收益",
  gmkj: "购买矿机<br>产量up",
  yqhy: "邀请好友获取算力",
  checkrecord: "查看记录",
  kj: "矿机",
  tkj:'目标矿机',
  kjtype:'类型',
  mrsl: "默认算力",
  mbkjsy: "目标收益",
  dqkjsy: "当前收益",
  wksysj: "挖矿剩余时间",
  ljjs: "累计减少：",
  jstimes: "加速次数",
  slmj: "算力秘籍",
  cksq: "查看矿工",
  kcjl: "矿池记录",
  ksdh: "快速兑换",
  dh: "兑换",
  xxjlck: "详细记录至兑换中心查看",
  dhzx: "兑换中心",
  dhjl: "兑换记录",
  dhtime: "时间",
  dhdui: "兑换对",
  dhsl: "兑换数量",
  mypool: "可用矿机",
  mypoolrecord:'矿工记录',
  kg: "矿工",
  kjzj: "矿机总价",
  jszl: "加速总量",
  gmsj: "购买时间",
  kjsc: "矿机商城",
  wksc: "挖矿时长",
  mbkj: "目标矿晶",
  yjkjsy: "预计矿晶收益",
  day: "天",
  tai: "台",
  gm: "购买",
  sysl: "剩余数量",
  slmjrh: "算力秘籍，如何玩转超级算力",
  cjsl: "超级算力",
  step1: ` 将CJT兑换成SUC积分，开启矿机购买模式。
                    <br> 
                     点击右上角的“兑换中心”，即可快速进行积分兑换，CJT与SUC可以进行互兑。`,
  step2: `选择合适的矿机，进行购买，每个矿机的矿晶将在购买后的预计时间全部产出完毕。
                    <br>  算力：算力越高的矿机，挖矿的时间将大幅度缩短。 
                    <br> 产量：矿机产出的矿晶（即SUC，可兑换成CJT）。`,
  step3: ` 邀请好友，组建社区，协作解锁模式开始，每成功邀请一位好友注册平台并购买矿机，将为自己的矿机解锁好友购买矿机金额的8%作为奖励。
                    <br> 节点社区的奖励也将按照对应社区的奖励制度进行发放，具体发放以具体奖励政策
                    为准。
                    <br> 平台将在矿机购买后的每7个自然日结算并划转一次奖励（SUC）至游戏账户内，
                    <br> 用户可根据需求兑换撑CJT。
                    <br> 奖励的解锁额度将按照矿机购买的时间由旧至新的时间排序进行顺序解锁，若某一
                    <br> 矿机产出完毕后还剩余解锁额度，将顺延至下一台矿机进行继续解锁。    `,
  step4: `可以购买多台矿机，组成庞大的矿池，产量UP！矿机数量有限，可以按照需要进
                    行购买。`,
  norecord:'暂时没有记录',
  kjtosee:'敬请期待',
  nostocks:'库存不足',
  cancel:'取消',
  confirm:'确认',
  surebuy:'确定要购买{kj}吗？',
  nodata:'暂时没有记录',
  onekeygetpower:'一键收取当日能量',
  storepowerforday: '蓄能中，明日再领取',
  dtlz: '点体力值',
  ifbuy:'是否确认购买',

  
  nljyz:'能量加油站',
  wyxn:'我要蓄能',
  buypower:'能量不够？点此跳转购买',
  hint:'提示',
  buyrecord:'购买记录',
  tltype:'类型',
  sl:'数量',
  money:'金额',
  yue:'余额',
  nlz:'能量值',
  gsnl:'光速能量',
  pooltatal:'矿池总量',
  yqhy:'邀请好友 <br>获取更多算力',
  allrecord:'加速记录',
  poolprogress:'矿池开采进度',
  hqnljz:'获取矿晶能量绝招',
  buykj:'购买矿机',
  getpowerperday:'可以每天收取能量',
  loginperday:"每天登录",
  
  hqmftl:'获取免费体力',
  yqhyd:'邀请好友',
  jskj:'快速解锁矿机能量',
  kjinfo:'矿机详情',
  buytl:'购买体力值',
  hftl:'可以换取{num}点能量值，用以收取矿晶',
  zshy:'赠送好友',
  zwkq:'暂未开启',
  buynow:'立即购买',
  quanman:'全满',
  gxgm:'挖矿成功',
  shareposter:'分享海报',
  xynl:'现有能量',
  xts:'小提示：别忘了每天登陆即可快速收取矿晶',
  srdhz:'输入兑换的值',
  sharewin: '分享海报，获取免费体力值',
  kjin: '矿晶',
  zghd:'总共获得',
  gameinstr:'游戏说明',
  des1: `

  1、单个矿机从购买之时开始计算，每24小时解锁一次可供挖取的矿晶
  <br>
  <br>
2、解锁的矿晶在24小时内可以免费挖取，超过24小时再挖取的矿晶需要通过能量道具1:1进行解锁（如挖取10点矿晶需要耗费10点能量，若存在小数情况能量将按照四舍五入计算收取，当前能量价格为1CJT：10能量
<br>
<br>
 3、矿机每日的参量与1.0版本保持一致，解锁天数同等保持不变
 <br> 
 <br>
4、矿机随着天数的增长耗损也随之增加，每日可免费挖取的矿晶会逐渐减少. 最终的损耗值大约为最高参量的1/2
  `,
  kjcdown: '下次挖矿时间'



};
