<template>
    <div class="gl">
        <h3>关于Joy摇摇乐</h3>
        <p>
            Joy摇摇乐是CryptoJOY在春节期间推出的限定游戏。JOY吉祥树上结了许多的金币红包，玩家可以摇一摇吉祥树收获金币红包（HB）奖励

 <br>
  <br>
 游戏简单易玩，是一款可以通过金币红包二次兑换矿机赢取挖矿奖励的游戏。这也是CryptoJOY对广大的社区玩家献上最诚挚的献礼。
</p>
        <h3>玩法说明</h3>
        <p>
            在游戏限定期内，玩家每轮可以获得1次摇一摇机会。奖池金额会随着玩家/平台的不断贡献而增长。玩家摇到红包奖励的金额将随机产生。当机会消耗完毕后，玩家可以选择等待下一轮再进行游戏，或者可以选择为自己增加额外的摇一摇机会。
       
       
       <h3>
           奖池说明
       </h3>
       <p>
           玩家每次摇一摇后，都将收到CryptoJOY社区的祝福签，摇到的红包金额将在奖池开奖后公布。
           <br>
           <br>
           所有的红包均参与奖池50%的分红，奖金的大小由区块链上产生的幸运随机数所决定，奖池剩下的35%进入下一期累计奖池。
       </p>

       <h3>
           大奖设置
       </h3>
       <p>
           每一轮游戏结束前，最后一位参与的玩家，将获得当前奖池10%的超级大奖。

       </p>
       <h3>
           幸运奖设置
       </h3>
       <p>
           每一轮游戏将产生一个幸运数字，摇到幸运数字的玩家将获当前奖池5%的幸运奖，
其余用户，越接近幸运数字，所获得的奖励就越大。
       </p>
       <h3>
           关于HB
       </h3>
       <p>
           玩家可通过累计HB，在后续开放的礼金商城中兑换更多的礼品， 如使用HB兑换矿机、领取实物奖励等，更多的权益陆续上线中，敬请期待！
       </p>
       <h3>
           摇摇乐vip
       </h3>
       <p>
           摇摇乐设置了5个Vip等级，玩家达到相应等级的经验值即可联系CJ小助手开通相应的Vip权益。经验值可通过积累摇一摇次数获得，每参与摇奖一次即可获得1点经验值。Vip等级越高可在礼金商城享受更优惠的矿机兑换政策，具体详情可见礼金商城。
       </p>
       <h3>
           获得额外机会
       </h3>
       <p>
           一、至页面的左上角选择“分享”，将游戏海报分享给好友，当1位好友通过海报上的玩家专属二维码成功注册CryptoJOY（即注册成为新用户），同时参与摇摇乐3次，玩家即可获得1次摇一摇机会，每日玩家通过邀请获得的次数上限为12次。
        <br>
        <br>
        二、至页面的左上角选择“塞金币”，将自己的心意通过金币的方式打包成红包传达出去，玩家每成功发送{{balance.min_money}}CJT生成红包1次，即可获得1次摇一摇的机会，此机会仅限当前轮有效。
       </p>
       
       <h3>
           特别声明
       </h3>
       <p>
           本游戏凭着公平公开的规则在进行，若玩家通过其他渠道违反游戏的公平性，比如但不限于通过特殊手段盗取奖金、恶意注册刷奖励等；平台一经发现将冻结玩家游戏账户，同时获得的奖励也将清零处理。该游戏/活动的最终解释权归CryptoJOY所有。
       </p>
       
       
       

    </div>
</template>
<script>
import {mapGetters} from 'vuex';
export default {
    computed: {
        ...mapGetters(['balance'])
    },
}
</script>
<style lang="scss">

</style>

